Laetelus/ESP32_Flight_Controller/src/Flight_Controller.cpp
#include <Arduino.h>
#include <ESP32Servo.h>
#include "I2Cdev.h"
#include "MPU6050.h"
#include <Wire.h>
#include <EEPROM.h>
#include "driver/gpio.h" //GPIO registers 
#include "Flight_Controller.h"


// Definitions of the static member variables.
volatile unsigned long Flight_Controller::last_rising_edge_throttle = 0;
volatile unsigned long Flight_Controller::last_rising_edge_yaw = 0;
volatile unsigned long Flight_Controller::last_rising_edge_pitch = 0;
volatile unsigned long Flight_Controller::last_rising_edge_roll = 0;

volatile unsigned long Flight_Controller::receiver_input_channel_3 = 0;
volatile unsigned long Flight_Controller::receiver_input_channel_4 = 0;
volatile unsigned long Flight_Controller::receiver_input_channel_1 = 0;
volatile unsigned long Flight_Controller::receiver_input_channel_2 = 0;


/*
  uncomment DEBUG_IMU to view IMU on webserver. DO NOT! upload both the flight controller
  software and the Webserver software if not testing IMU. 
*/ 
//#define DEBUG_IMU

//#define USE_EEPROM

// Flight controller interface 
void Flight_Controller::initialize()
{

  Serial.begin(250000);
  pinMode(2,OUTPUT); //LED status 
  #ifdef DEBUG_IMU
    initWiFi();
    initSPIFFS();
    Handle_Server(); 
  #endif

  // Allow allocation of all timers. Consistent and accurate PWM. 
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  // join I2C bus (I2Cdev library doesn't do this automatically)
  #if I2CDEV_IMPLEMENTATION == I2CDEV_ARDUINO_WIRE
      Wire.begin();
      Wire.setClock(400000); // 400kHz I2C clock (200kHz if CPU is 8MHz). Comment this line if having compilation difficulties
  #elif I2CDEV_IMPLEMENTATION == I2CDEV_BUILTIN_FASTWIRE
     Fastwire::setup(400, true);
  #endif

  // initialize device. This also initialises the gyros and accelerometers 
  Serial.println("Initializing I2C devices...");
  accelgyro.initialize();
  // Verify gyroscope range
  uint8_t gyroRange = accelgyro.getFullScaleGyroRange();
  if (gyroRange == MPU6050_IMU::MPU6050_GYRO_FS_250) {
    Serial.println("Gyroscope range verified as ±250°/s");
  } else {
    Serial.println("Gyroscope range verification failed");
  }
  // Verify accelerometer range
  uint8_t accelRange = accelgyro.getFullScaleAccelRange();
  if (accelRange == MPU6050_IMU::MPU6050_ACCEL_FS_2) {
    Serial.println("Accelerometer range verified as ±2g");
  } else {
    Serial.println("Accelerometer range verification failed");
  }
  // verify connection
  #ifdef I2CDEV_IMPLEMENTATION
    Serial.println("Testing device connections...");
    Serial.println(accelgyro.testConnection() ? "accelgyro6050 connection successful" : "accelgyro6050 connection failed");
  #endif   

  delay(100);  

 
  //Be careful with commenting and uncommenting this function. 
  //clearCalibrationData();

  // Warm-up time for the MPU6050 (LED will stay on for 4secs to indicate warm-up time)
  Serial.println("Warming up MPU6050...");
  digitalWrite(2, HIGH);
  delay(4000);
  digitalWrite(2, LOW);
  Serial.println("Warm-up complete.");

  // Read current temperature
  temp = accelgyro.getTemperature();
  temperatureC = float(temp) / 340.00 + 36.53;
  Serial.print("Current temperature: ");
  Serial.println(temperatureC);

  // Calibration with or without EEPROM (only store EEPROM when data is satisfactory)
  #ifdef USE_EEPROM
    EEPROM.begin(EEPROM_SIZE);
    if (!loadCalibrationValues()) {
      Serial.println("Calibration data not found in EEPROM. Calibrating...");
      // Blink LED to indicate calibration in progress
      for (int i = 0; i < 10; ++i) {
        digitalWrite(2, HIGH);
        delay(100);
        digitalWrite(2, LOW);
        delay(100);
      }
      calibrateMPU6050();
      // Check if the temperature is within the acceptable range
      int minTemp = -40; // Replace with your minimum temperature value (according to datasheet)
      int maxTemp = 85; // Replace with your maximum temperature value (according to datasheet)
      if (temperatureC >= minTemp && temperatureC <= maxTemp) {
        saveCalibrationValues();
        Serial.println("Calibration complete and saved to EEPROM.");
      } else {
        Serial.println("Calibration complete but temperature out of range. Calibration not saved.");
      }
     // Turn off LED
    digitalWrite(2, LOW);
  } else {
    Serial.println("Calibration data loaded from EEPROM.");
  }
  #else
    Serial.println("Calibrating without EEPROM...");
    digitalWrite(2, HIGH);
    calibrateMPU6050();
    // Check if the temperature is within the acceptable range
    int minTemp = -40; // Replace with your minimum temperature value
    int maxTemp = 85;  // Replace with your maximum temperature value
    if (temperatureC >= minTemp && temperatureC <= maxTemp) {
      Serial.println("Temperature data stored without EEPROM.");
    } else {
      Serial.println("Calibration complete but temperature out of range.");
    }
    digitalWrite(2, LOW);
  #endif
  
  printStoredCalibrationValues(); 
  //setupInterrupts(); 

  // Configure pins and attach interrupts
  pinMode(THROTTLE, INPUT);
  attachInterrupt(digitalPinToInterrupt(THROTTLE), Flight_Controller::handleThrottleInterrupt, CHANGE);
  
  pinMode(YAW, INPUT);
  attachInterrupt(digitalPinToInterrupt(YAW), Flight_Controller::handleYawInterrupt, CHANGE);
  
  pinMode(PITCH, INPUT);
  attachInterrupt(digitalPinToInterrupt(PITCH), Flight_Controller::handlePitchInterrupt, CHANGE);
  
  pinMode(ROLL, INPUT);
  attachInterrupt(digitalPinToInterrupt(ROLL), Flight_Controller::handleRollInterrupt, CHANGE);

  // attach esc pins
  esc1.attach(esc_pin1, MIN_PULSE_LENGTH, MAX_PULSE_LENGTH); // FR (Front Right)
  esc2.attach(esc_pin3, MIN_PULSE_LENGTH, MAX_PULSE_LENGTH); // BR (Back Right)
  esc3.attach(esc_pin2, MIN_PULSE_LENGTH, MAX_PULSE_LENGTH); // FL (Front Left)
  esc4.attach(esc_pin4, MIN_PULSE_LENGTH, MAX_PULSE_LENGTH); // BL (Back Left)

  // arm ecs
  esc1.writeMicroseconds(MIN_PULSE_LENGTH);
  esc2.writeMicroseconds(MIN_PULSE_LENGTH);
  esc3.writeMicroseconds(MIN_PULSE_LENGTH);
  esc4.writeMicroseconds(MIN_PULSE_LENGTH);

