Laetelus/ESP32_Flight_Controller/src/Flight_Controller.cpp
}

void IRAM_ATTR Flight_Controller::handleThrottleInterrupt() {
  uint32_t gpio_state = GPIO.in1.val; // For pins 32-39
  unsigned long timestamp = micros(); // Capture the current time once

  if (gpio_state & (1 << (THROTTLE - 32))) { // Adjust bit position for pins 32-39
    last_rising_edge_throttle = timestamp;
  } else { // Pin must be LOW
    receiver_input_channel_3 = timestamp - last_rising_edge_throttle;
  }
}



void IRAM_ATTR Flight_Controller::handleYawInterrupt() {
  uint32_t gpio_state = GPIO.in1.val; // For pins 32-39
  unsigned long timestamp = micros(); // Capture the current time once

  if (gpio_state & (1 << (YAW - 32))) { // Adjust bit position for pins 32-39
    last_rising_edge_yaw = timestamp;
  } else { // Pin must be LOW
    receiver_input_channel_4 = timestamp - last_rising_edge_yaw;
  }
}



void IRAM_ATTR Flight_Controller::handlePitchInterrupt() {
  uint32_t gpio_state = GPIO.in1.val; // For pins 32-39
  unsigned long timestamp = micros(); // Capture the current time once

  if (gpio_state & (1 << (PITCH - 32))) { // Adjust bit position for pins 32-39
    last_rising_edge_pitch = timestamp;
  } else { // Pin must be LOW
    receiver_input_channel_1 = timestamp - last_rising_edge_pitch;
  }
}


void IRAM_ATTR Flight_Controller::handleRollInterrupt() {
  uint32_t gpio_state = GPIO.in1.val; // For pins 32-39
  unsigned long timestamp = micros(); // Capture the current time once

  if (gpio_state & (1 << (ROLL - 32))) { // Adjust bit position for pins 32-39
    last_rising_edge_roll = timestamp;
  } else { // Pin must be LOW
    receiver_input_channel_2 = timestamp - last_rising_edge_roll;
  }
}



void Flight_Controller::level_flight() {
  // 65.5 = 1 deg/sec (check the datasheet of the accelgyro-6050 for more information).
  gyro_roll_input = (gyro_roll_input * 0.7) + ((gyro_roll / 65.5) * 0.3);    // Gyro pid input is deg/sec.
  gyro_pitch_input = (gyro_pitch_input * 0.7) + ((gyro_pitch / 65.5) * 0.3); // Gyro pid input is deg/sec.
  gyro_yaw_input = (gyro_yaw_input * 0.7) + ((gyro_yaw / 65.5) * 0.3);       // Gyro pid input is deg/sec.

  // Gyro angle calculations
  // 0.0000611 = 1 / (250Hz / 65.5)
  angle_pitch += gyro_pitch * 0.0000611; // Calculate the traveled pitch angle and add this to the angle_pitch variable.
  angle_roll += gyro_roll * 0.0000611;   // Calculate the traveled roll angle and add this to the angle_roll variable.

  // 0.000001066 = 0.0000611 * (3.142(PI) / 180degr) The Arduino sin function is in radians
  angle_pitch -= angle_roll * sin(gyro_yaw * 0.000001066); //If the IMU has yawed transfer the roll angle to the pitch angel.
  angle_roll += angle_pitch * sin(gyro_yaw * 0.000001066); //If the IMU has yawed transfer the pitch angle to the roll angel.

  // Accelerometer angle calculations
  acc_total_vector = sqrt((ax_mps2 * ax_mps2) + (ay_mps2 * ay_mps2) + (az_mps2 * az_mps2));

  if (abs(ax_mps2) < acc_total_vector)
  { // Prevent the asin function to produce a NaN
    angle_pitch_acc = asin((float)ax_mps2 / acc_total_vector) * 57.296; // Calculate the pitch angle.
  }
  if (abs(ay_mps2) < acc_total_vector)
  {  // Prevent the asin function to produce a NaN
    angle_roll_acc = -asin((float)ay_mps2 / acc_total_vector) * -57.296; // Calculate the roll angle.
  }

  // // Place the accelgyro-6050 spirit level and note the values in the following two lines for calibration.
  //No need since we are already subtracting our offset. 
  // angle_pitch_acc -= 0.0; // Accelerometer calibration value for pitch.
  // angle_roll_acc -= 0.0;  // Accelerometer calibration value for roll.

  angle_pitch = angle_pitch * 0.9996 + angle_pitch_acc * 0.0004; // Correct the drift of the gyro pitch angle with the accelerometer pitch angle.
  angle_roll = angle_roll * 0.9996 + angle_roll_acc * 0.0004;    // Correct the drift of the gyro roll angle with the accelerometer roll angle.

  pitch_level_adjust = angle_pitch * 15; // Calculate the pitch angle correction
  roll_level_adjust = angle_roll * 15;   // Calculate the roll angle correction
  
  if (!auto_level)
  {                         // If the quadcopter is not in auto-level mode
    pitch_level_adjust = 0; // Set the pitch angle correction to zero.
    roll_level_adjust = 0;  // Set the roll angle correcion to zero.
  }
}

void Flight_Controller::motorControls() {
  noInterrupts(); // Disable interrupts to create a consistent snapshot of the variables.
  // Create local copies of the input channels
  unsigned long local_input_channel_1 = receiver_input_channel_1;
  unsigned long local_input_channel_2 = receiver_input_channel_2;
  unsigned long local_input_channel_3 = receiver_input_channel_3;
  unsigned long local_input_channel_4 = receiver_input_channel_4;
  interrupts(); // Re-enable interrupts as soon as possible

  // For starting the motors: throttle low and yaw left (step 1).
  if (local_input_channel_3 < 1065 && local_input_channel_4 < 1050)
  {
    start = 1;
  }

  // When yaw stick is back in the center position start the motors (step 2).
  if (start == 1 && local_input_channel_3 < 1550 && local_input_channel_4 > 1450)
  {
    start = 2;

    angle_pitch = angle_pitch_acc; // Set the gyro pitch angle equal to the accelerometer pitch angle when the quadcopter is started.
    angle_roll = angle_roll_acc;   // Set the gyro roll angle equal to the accelerometer roll angle when the quadcopter is started.
    
    gyro_angles_set = true;        // Set the IMU started flag.

    // Reset the PID controllers for a bumpless start.
    pid_i_mem_roll = 0;
    pid_last_roll_d_error = 0;
    pid_i_mem_pitch = 0;
    pid_last_pitch_d_error = 0;
    pid_i_mem_yaw = 0;
    pid_last_yaw_d_error = 0;
  }

  // Stopping the motors: throttle low and yaw right.
  if (start == 2 && local_input_channel_3 <= 1064 && local_input_channel_4 > 1976)
  {
    start = 0;
  }

  // The PID set point in degrees per second is determined by the roll receiver input.
  // In the case of deviding by 3 the max roll rate is aprox 164 degrees per second ( (500-8)/3 = 164d/s ).
  pid_roll_setpoint = 0;

  // We need a little dead band of 16us for better results.
  if (local_input_channel_1 > 1508)
  {
    pid_roll_setpoint = local_input_channel_1 - 1508;
  }
  else if (local_input_channel_1 < 1492)
  {
    pid_roll_setpoint = local_input_channel_1 - 1492;
  }

