Laetelus/ESP32_Flight_Controller/src/Flight_Controller.cpp
  pid_last_roll_d_error = pid_error_temp;

  // Pitch calculations
  pid_error_temp = gyro_pitch_input - pid_pitch_setpoint;
  pid_i_mem_pitch += pid_i_gain_pitch * pid_error_temp;
  if (pid_i_mem_pitch > pid_max_pitch)
    pid_i_mem_pitch = pid_max_pitch;
  else if (pid_i_mem_pitch < pid_max_pitch * -1)
    pid_i_mem_pitch = pid_max_pitch * -1;

  pid_output_pitch = pid_p_gain_pitch * pid_error_temp + pid_i_mem_pitch + pid_d_gain_pitch * (pid_error_temp - pid_last_pitch_d_error);
  if (pid_output_pitch > pid_max_pitch)
    pid_output_pitch = pid_max_pitch;
  else if (pid_output_pitch < pid_max_pitch * -1)
    pid_output_pitch = pid_max_pitch * -1;

  pid_last_pitch_d_error = pid_error_temp;

  // Yaw calculations
  pid_error_temp = gyro_yaw_input - pid_yaw_setpoint;
  pid_i_mem_yaw += pid_i_gain_yaw * pid_error_temp;
  if (pid_i_mem_yaw > pid_max_yaw)
    pid_i_mem_yaw = pid_max_yaw;
  else if (pid_i_mem_yaw < pid_max_yaw * -1)
    pid_i_mem_yaw = pid_max_yaw * -1;

  pid_output_yaw = pid_p_gain_yaw * pid_error_temp + pid_i_mem_yaw + pid_d_gain_yaw * (pid_error_temp - pid_last_yaw_d_error);
  if (pid_output_yaw > pid_max_yaw)
    pid_output_yaw = pid_max_yaw;
  else if (pid_output_yaw < pid_max_yaw * -1)
    pid_output_yaw = pid_max_yaw * -1;

  pid_last_yaw_d_error = pid_error_temp;
}


void Flight_Controller::readGyroData() {
    // Read gyro and accelerometer data here
    accelgyro.getMotion6(&acc_x, &acc_y, &acc_z, &gyro_roll, &gyro_pitch, &gyro_yaw);
}


void Flight_Controller::calibrateMPU6050() {

  long buff_ax = 0, buff_ay = 0, 
  buff_az = 0, buff_gx = 0, 
  buff_gy = 0, buff_gz = 0;

  const int num_samples = 1000;
  for (int i = 0; i < num_samples; i++) {
    readGyroData(); 
    buff_ax += acc_x;
    buff_ay += acc_y;
    buff_az += acc_z;
    buff_gx += gyro_roll;
    buff_gy += gyro_pitch;
    buff_gz += gyro_yaw;
    delay(2); // wait for sampling at 500Hz
  }

  // Average the values
  accXOffset  = buff_ax  / num_samples;
  accYOffset  = buff_ay  / num_samples;
  accZOffset  =(buff_az  / num_samples) - 16384; // considering 1g offset
  gyroXOffset = buff_gx / num_samples;
  gyroYOffset = buff_gy / num_samples;
  gyroZOffset = buff_gz / num_samples;

}

void Flight_Controller::saveCalibrationValues() {
  if (EEPROM.readLong(0) != 0x12345678) {
    EEPROM.writeLong(0, 0x12345678);  // Unique identifier indicating values have been saved
    EEPROM.writeLong(4, accXOffset);
    EEPROM.writeLong(8, accYOffset);
    EEPROM.writeLong(12, accZOffset);
    EEPROM.writeLong(16, gyroXOffset);
    EEPROM.writeLong(20, gyroYOffset);
    EEPROM.writeLong(24, gyroZOffset);
    EEPROM.writeFloat(28, temperatureC); 
    EEPROM.commit();
    Serial.println("Calibration values saved to EEPROM");
  } else {
    Serial.println("EEPROM already contains calibration values. Skipping save.");
  }
}

bool Flight_Controller::loadCalibrationValues() {
  if (EEPROM.readLong(0) != 0x12345678) {
    return false; // Calibration data not found or not valid
  }
  accXOffset  = EEPROM.readLong(4);
  accYOffset  = EEPROM.readLong(8);
  accZOffset  = EEPROM.readLong(12);
  gyroXOffset = EEPROM.readLong(16);
  gyroYOffset = EEPROM.readLong(20);
  gyroZOffset = EEPROM.readLong(24);
  temperatureC = EEPROM.readFloat(28);  
  return true;
}

//Only use if needed to get new values or writing did not go well. 
void Flight_Controller::clearCalibrationData() {
  EEPROM.begin(EEPROM_SIZE);
  //Set a specific value to indicate that the data is cleared or invalid
  long invalidValue = 0;
  
  EEPROM.writeLong(0, invalidValue);
  EEPROM.writeLong(4, invalidValue);
  EEPROM.writeLong(8, invalidValue);
  EEPROM.writeLong(12, invalidValue);
  EEPROM.writeLong(16, invalidValue);
  EEPROM.writeLong(20, invalidValue);
  EEPROM.writeLong(24, invalidValue); 
  EEPROM.writeFloat(28, invalidValue); 

  EEPROM.commit(); // Make sure to commit the changes to EEPROM
  Serial.println("Calibration data cleared.");
}

void Flight_Controller::printStoredCalibrationValues() {

  // Addresses where the calibration values are stored
  const int gyroXOffsetAddr = 4;
  const int gyroYOffsetAddr = 8;
  const int gyroZOffsetAddr = 12;
  const int accXOffsetAddr = 16;
  const int accYOffsetAddr = 20;
  const int accZOffsetAddr = 24;
  const int tempOffsetAddr = 28;  

  // Check for unique ID
  if (EEPROM.readLong(0) == 0x12345678) {
    // Read and print stored offset values
    int32_t storedGyroXOffset = EEPROM.readLong(gyroXOffsetAddr);
    int32_t storedGyroYOffset = EEPROM.readLong(gyroYOffsetAddr);
    int32_t storedGyroZOffset = EEPROM.readLong(gyroZOffsetAddr);
    int32_t storedAccXOffset = EEPROM.readLong(accXOffsetAddr);
    int32_t storedAccYOffset = EEPROM.readLong(accYOffsetAddr);
    int32_t storedAccZOffset = EEPROM.readLong(accZOffsetAddr);
    float storedTempOffset = EEPROM.readFloat(tempOffsetAddr);

    Serial.println("Stored calibration values in EEPROM:");
    Serial.print("Gyro X Offset: "); Serial.println(storedGyroXOffset);
    Serial.print("Gyro Y Offset: "); Serial.println(storedGyroYOffset);
    Serial.print("Gyro Z Offset: "); Serial.println(storedGyroZOffset);
    Serial.print("Acc X Offset: "); Serial.println(storedAccXOffset);
    Serial.print("Acc Y Offset: "); Serial.println(storedAccYOffset);
    Serial.print("Acc Z Offset: "); Serial.println(storedAccZOffset);
    Serial.print("Temperature: "); Serial.println(tempOffsetAddr);
  } else {
    Serial.println("No valid data found in EEPROM");
  }
}



int16_t Flight_Controller::applyDeadzone(int16_t value, int16_t deadzone) {
  if (abs(value) < deadzone) {
    return 0;
  }
  return value > 0 ? value - deadzone : value + deadzone;
}

void Flight_Controller::processIMUData() {
  /*
    whenever we retrieve gyro and accelerometer data, 
    we'll want to subtract these offsets from the raw values. 
  */
  gyro_roll  -= gyroXOffset;
  gyro_pitch -= gyroYOffset;
  gyro_yaw   -= gyroZOffset;
  acc_x -= accXOffset;
  acc_y -= accYOffset;
  acc_z -= accZOffset;

