Laetelus/ESP32_Flight_Controller/src/Flight_Controller.cpp
  // Apply the deadzone
  acc_x = applyDeadzone(acc_x, 100);
  acc_y = applyDeadzone(acc_y, 100);
  acc_z = applyDeadzone(acc_z, 100);
    
  gyro_roll  = applyDeadzone(gyro_roll, 1);
  gyro_pitch = applyDeadzone(gyro_pitch, 1);
  gyro_yaw   = applyDeadzone(gyro_yaw , 1);

  gyro_roll = -gyro_roll; // Invert the roll
  gyro_yaw = -gyro_yaw;  // Invert the roll

  /*All three axes of the accelerometer (X, Y, and Z) measure acceleration 
    in units of g, and thus all three need to be converted to m/s² to have 
    consistent units across all axes. 
  */
  ax_mps2 = -((float)acc_x / 16384.0) * 9.81;
  ay_mps2 = -((float)acc_y / 16384.0) * 9.81;
  az_mps2 = ((float)acc_z / 16384.0) * 9.81;

  #ifdef DEBUG_IMU
    Send_Event();
  #endif // DEBUG_IMU
}

void Flight_Controller::print_gyro_data() {

  Serial.print("\nRaw Gyro Pitch: "); 
  Serial.println(gyro_pitch); 
  
  Serial.print("Raw Gyro Roll: "); 
  Serial.println(gyro_roll); 
  
  Serial.print("Raw Gyro Yaw: "); 
  Serial.println(gyro_yaw); 

  Serial.print("--------------------"); 
  Serial.print("\ngyro_pitch_input: "); 
  Serial.println(gyro_pitch_input);  //converted to degrees with comp filter data

  Serial.print("gyro_roll_input: "); 
  Serial.println(gyro_roll_input);
  
  Serial.print("gyro_yaw_input: "); 
  Serial.println(gyro_yaw_input);

  Serial.print("--------------------"); 
  Serial.print("\nAngle Pitch: "); 
  Serial.println(angle_pitch);

  Serial.print("Angle Roll: "); 
  Serial.println(angle_roll);

  Serial.print("--------------------");   
  Serial.print("\nangle_pitch_acc: ");
  Serial.println(angle_pitch_acc);

  Serial.print("angle_roll_acc: ");
  Serial.println(angle_roll_acc);

  Serial.print("--------------------"); 
  Serial.print("\nPitch Adjust: "); 
  Serial.println(pitch_level_adjust);

  Serial.print("Roll Adjust: "); 
  Serial.println(roll_level_adjust);

  Serial.print("--------------------"); 
  Serial.print("\nAcc X: "); 
  Serial.println(ax_mps2);

  Serial.print("Acc Y: "); 
  Serial.println(ay_mps2);

  Serial.print("Acc Z (m/s^2): "); 
  Serial.println(az_mps2);
  Serial.print("--------------------"); 
  
  // Serial.print("\nThrottle: ");
  // Serial.println(receiver_input_channel_3); 
  // Serial.print("Yaw: ");
  // Serial.println(receiver_input_channel_4); 
  // Serial.print("Pitch: ");
  // Serial.println(receiver_input_channel_1); 
  // Serial.print("Roll: ");
  // Serial.println(receiver_input_channel_2); 

  // Serial.print("\nESC1: "); 
  // Serial.println(esc_1);
  // Serial.print("ESC2: "); 
  // Serial.println(esc_2);
  // Serial.print("ESC3: "); 
  // Serial.println(esc_3);
  // Serial.print("ESC4: "); 
  // Serial.println(esc_4);
}